app/controllers/cars_controller.rb

  def index
    @cars = Car.all
---
SELECT * FROM `cars`

  def show
    @car = Car.find(params[:id])
---
SELECT * FROM `cars` WHERE (`cars`.`id` = 1)

  def create
    @car = Car.new(params[:car])
    if @car.save
---
INSERT INTO `cars` (`model`, `model_year`, `created_at`, `updated_at`, `color`, `make`, `board`, `manufacture_year`) VALUES('Punto', 2008, '2009-12-06 01:26:40', '2009-12-06 01:26:40', 'Prata', 'Fiat', 'ABC-4321', 2008)

  def edit
    @car = Car.find(params[:id])
---
SELECT * FROM `cars` WHERE (`cars`.`id` = 2)

  def update
    @car = Car.find(params[:id])
---
SELECT * FROM `cars` WHERE (`cars`.`id` = 2)

  def destroy
    @car = Car.find(params[:id])
    @car.destroy
---
SELECT * FROM `cars` WHERE (`cars`.`id` = 2)
DELETE FROM `cars` WHERE `id` = 2