app/controllers/employees_controller.rb

  def index
    @employees = Employee.all
---
SELECT * FROM `employees`

  def show
    @employee = Employee.find(params[:id])
---
SELECT * FROM `employees` WHERE (`employees`.`id` = 1)

  def create
    @employee = Employee.new(params[:employee])
    if @employee.save
---
INSERT INTO `employees` (`name`, `position`, `created_at`, `updated_at`, `telephone`, `department_id`, `email`) VALUES('Giovani', 'Analista de Tecnologia', '2009-12-06 20:08:21', '2009-12-06 20:08:21', '(11) 9664-9987', NULL, 'giovani.generali@gmail.com')

  def edit
    @employee = Employee.find(params[:id])
---
SELECT * FROM `employees` WHERE (`employees`.`id` = 6)

  def update
    @employee = Employee.find(params[:id])
    if @employee.update_attributes(params[:employee])
---
SELECT * FROM `employees` WHERE (`employees`.`id` = 6)
UPDATE `employees` SET `updated_at` = '2009-12-06 22:01:22', `department_id` = 6 WHERE `id` = 8

  def destroy
    @employee = Employee.find(params[:id])
    @employee.destroy
---
SELECT * FROM `employees` WHERE (`employees`.`id` = 1)
DELETE FROM `employees` WHERE `id` = 1

  def find_departments
    @departments = Department.find(:all, :order => "name")
---
SELECT * FROM `departments` WHERE (`departments`.`name` = '--- :all\n') LIMIT 1