app/controllers/inspections_controller.rb

  def index
    @inspections = Inspection.all
---
SELECT * FROM `inspections`

  def show
    @inspection = Inspection.find(params[:id])
---
SELECT * FROM `inspections` WHERE (`inspections`.`id` = 1)

  def create
    @inspection = Inspection.new(params[:inspection])
    if @inspection.save
---
INSERT INTO `inspections` (`created_at`, `updated_at`, `date`, `car_id`, `description`) VALUES('2009-12-07 02:31:20', '2009-12-07 02:31:20', '2009-12-07', NULL, 'teste')

  def edit
    @inspection = Inspection.find(params[:id])
---
SELECT * FROM `inspections` WHERE (`inspections`.`id` = 4)

  def update
    @inspection = Inspection.find(params[:id])
    if @inspection.update_attributes(params[:inspection])
---
SELECT * FROM `inspections` WHERE (`inspections`.`id` = 4)
UPDATE `inspections` SET `updated_at` = '2009-12-07 03:42:14', `description` = 'Test' WHERE `id` = 4

  def destroy
    @inspection = Inspection.find(params[:id])
    @inspection.destroy
---
SELECT * FROM `inspections` WHERE (`inspections`.`id` = 2)
DELETE FROM `inspections` WHERE `id` = 2

  def find_cars
    @cars = Car.find(:all, :order => "model, board")
---
SELECT * FROM `cars` WHERE (`cars`.`id` = 1)